app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "title", "updated_at", "video") VALUES (?, ?, ?, ?)  [["created_at", Sun, 15 Mar 2015 21:41:36 UTC +00:00], ["title", "Anurag Video1"], ["updated_at", Sun, 15 Mar 2015 21:41:36 UTC +00:00], ["video", "blob"]]
---
    def create
    	@user = User.new
        @user.title=params[:user]
        @user.video = params[:video]

        if @user.save